InformationRegisters/НастройкиНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособНумерации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНумерации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нумераторы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нумеровать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиНумерации/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеОтбора") И ЗначениеЗаполнено(Параметры.ЗначениеОтбора) Тогда 
		Измерения = Метаданные.РегистрыСведений.НастройкиНумерации.Измерения;
		Для Каждого Измерение Из Измерения Цикл
			Если Измерение.Тип.СодержитТип(ТипЗнч(Параметры.ЗначениеОтбора)) Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
					Измерение.Имя,
					Параметры.ЗначениеОтбора);
				Элементы[Измерение.Имя].Видимость = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеОбработчик", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОбработчик()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	СтруктураДополнительныхДанных = Новый Структура;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Организация) Тогда 
		Организация = ТекущиеДанные.Организация;
	Иначе 
		Организация = НСтр("ru = 'Все'; en = 'All'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда 
		Подразделение = ТекущиеДанные.Подразделение;
	Иначе 
		Подразделение = НСтр("ru = 'Все'; en = 'All'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВопросДеятельности) Тогда 
		ВопросДеятельности = ТекущиеДанные.ВопросДеятельности;
	Иначе 
		ВопросДеятельности = НСтр("ru = 'Все'; en = 'All'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Контрагент) Тогда 
		Контрагент = ТекущиеДанные.Контрагент;
	Иначе 
		Контрагент = НСтр("ru = 'Все'; en = 'All'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Проект) Тогда 
		Проект = ТекущиеДанные.Проект;
	Иначе 
		Проект = НСтр("ru = 'Все'; en = 'All'");
	КонецЕсли;
	
КонецПроцедуры
